cases/periodicHill/transient_kOmega_2D/system/sampleR
type            sets;
libs            (sampling);
interpolationScheme cellPoint;
setFormat       raw;
executeControl  onEnd;
writeControl    onEnd;

fields ( "turbulenceProperties:R" );

sets
{
    xbyh0.05 { type face; axis y; start (0.0014 0 0.063); end (0.0014 1 0.063); }
    xbyh0.5  { type face; axis y; start (0.014  0 0.063); end (0.014  1 0.063); }
    xbyh1    { type face; axis y; start (0.028  0 0.063); end (0.028  1 0.063); }
    xbyh2    { type face; axis y; start (0.056  0 0.063); end (0.056  1 0.063); }
    xbyh3    { type face; axis y; start (0.084  0 0.063); end (0.084  1 0.063); }
    xbyh4    { type face; axis y; start (0.112  0 0.063); end (0.112  1 0.063); }
    xbyh5    { type face; axis y; start (0.140  0 0.063); end (0.140  1 0.063); }
    xbyh6    { type face; axis y; start (0.168  0 0.063); end (0.168  1 0.063); }
    xbyh7    { type face; axis y; start (0.196  0 0.063); end (0.196  1 0.063); }
    xbyh8    { type face; axis y; start (0.224  0 0.063); end (0.224  1 0.063); }
}
